[{"Software":"abc/abcrf","Class of method":"ABC","Purpose":"Performs all steps for model-checking and parameters estimation for ABC analyses. abcrf includes random forest methods (a type of supervised machine-learning)","Specifics":"Informative vignette, allows graphical representation, complete and robust","Issues and warnings":"Does not perform coalescent simulations (but can be used in combination with coala)","Link":"https://cran.r-project.org/web/packages/abc/index.html ; https://cran.r-project.org/web/packages/abcrf/index.html","Reference":"(Csilléry et al., 2012; Raynal et al., 2019)"},{"Software":"DILS","Class of method":"ABC/Random Forest","Purpose":"Fitting demographic histories","Specifics":"Fast, Automated. Provides a user-friendly interface as a singularity container. A particular strength is its ability to model linked selection and barriers to gene flow. Similar to DIYABC, all diagnostics and simulations are performed automatically.","Issues and warnings":"The method assumes no linkage between loci. Not suited for recent divergence. Not suited for more than 2 populations. Infers the most likely demographic scenario before estimating the effects of linked selection","Link":"https://github.com/dils-popgen/dils","Reference":"(Fraïsse et al., 2021)"},{"Software":"RIDGE","Class of method":"ABC/Random Forest","Purpose":"Fitting demographic histories and identify genomic islands","Specifics":"Fast, Automated through SnakeMake and a singularity container. Unlike DILS, can work on successive, linked genomic windows. Like DILS, can model linked selection and barriers to gene flow. Similar to DIYAB, all diagnostics and simulations are performed automatically.","Issues and warnings":"Not suited for recent divergence. Not suited for more than 2 populations. Can use a recombination map. I would recommend using a VCF with invariant sites to limit bias in summary statistics estimation. Infers the most likely demographic scenario before estimating the effects of linked selection","Link":"https://github.com/EwenBurban/RIDGE","Reference":"(Burban et al., 2024)"},{"Software":"gIMble","Class of method":"Likelihood","Purpose":"Fitting demographic histories and identify genomic islands","Specifics":"First models an Isolation-with-Migration model, then identifies variation in migration and Ne along slidiing windows in the genome. Can take VCF and BAM files as input.","Issues and warnings":"Not suited for recent divergence. Not suited for more than 2 populations. Does not model interruptions in gene flow (continuous IM model). Available through conda (be careful with dependencies). ","Link":"https://github.com/LohseLab/gIMble","Reference":"(Laetsch et al., 2023)"},{"Software":"ABCToolbox","Class of method":"ABC","Purpose":"Complete ABC analysis, from simulations to model checking and parameters estimation","Specifics":"Modular, facilitates the computation of summary statistics","Issues and warnings":"NA","Link":"https://bitbucket.org/wegmannlab/abctoolbox/wiki/Home","Reference":"(Wegmann et al., 2010)"},{"Software":"DIYABC","Class of method":"ABC","Purpose":"Complete ABC analysis, from simulations to model checking and parameters estimation","Specifics":"User-friendly. Many ways to check goodness-of-fit. Good introduction to ABC models.","Issues and warnings":"Does not model continuous gene flow.","Link":"http://www1.montpellier.inra.fr/CBGP/diyabc/","Reference":"(Cornuet et al., 2008)"},{"Software":"PopSizeABC","Class of method":"ABC","Purpose":"Inferring change in Ne using whole-genome data","Specifics":"Supposed to better assess recent events. Uses a set of summary statistics for the AFS and LD between markers. Handles multiple individuals","Issues and warnings":"Approximate bayesian approaches do not retrieve the whole information","Link":"https://forge-dga.jouy.inra.fr/projects/popsizeabc/","Reference":"(Boistard et al., 2016)"},{"Software":"coala","Class of method":"ABC/coalescent simulations","Purpose":"Combining coalescent simulators within a single framework","Specifics":"Facilitates the building of scenarios and computes summary statistics for simulations. Can be easily combined with the abc or abc-rf packages in R.","Issues and warnings":"Includes so far ms, msms and scrm","Link":"https://cran.r-project.org/web/packages/coala/index.html","Reference":"(Staab and Metzler, 2016)"},{"Software":"FacSexCoalescent","Class of method":"coalescent simulations","Purpose":"Simulate demographic scenarios for asexual/facultatively sexual species","Specifics":"Can handle varying levels of sexual reproduction, inbreeding, selfing and cloning.","Issues and warnings":"Does not handle population size changes nor selection yet.","Link":"https://github.com/MattHartfield/FacSexCoalescent ; https://github.com/MattHartfield/FacSexCoalescentR","Reference":"(Hartfield et al., 2016)"},{"Software":"fastsimcoal2","Class of method":"coalescent simulations","Purpose":"Building any arbitrary scenario using a coalescent framework","Specifics":"Any arbitrary scenario can be implemented. Handles SNP, microsatellites and sequence data.","Issues and warnings":"Does not handle selection. Slower than ms with no recombination, much faster with recombination (see manual)","Link":"http://cmpg.unibe.ch/software/fastsimcoal2/","Reference":"(Excoffier and Foll, 2011)"},{"Software":"ms, msms, msABC","Class of method":"coalescent simulations","Purpose":"Building any arbitrary scenario using a coalescent framework","Specifics":"Any arbitrary scenario can be implemented. Handles SNP, microsatellites and sequence data. msms can include selection in the model.","Issues and warnings":"Syntax can be difficult to handle for new users compared to, e.g., fastsimcoal2 (but see coala)","Link":"http://www.bio.lmu.de/~pavlidis/home/?Software:msABC","Reference":"(Hudson, 2002; Ewing and Hermisson, 2010; Pavlidis et al., 2010)"},{"Software":"msms","Class of method":"coalescent simulations","Purpose":"Simulate demographic scenarios including selection","Specifics":"Flexible, syntax similar to ms, handles arbitratily complex models. Can be used in an ABC framework to include selection as a parameter to be estimated","Issues and warnings":"Syntax can be difficult to handle for the naive user (but see coala)","Link":"http://www.mabs.at/ewing/msms/index.shtml","Reference":"(Ewing and Hermisson, 2010)"},{"Software":"scrm","Class of method":"coalescent simulations","Purpose":"Fast simulation of chromosome-scale sequences","Specifics":"Syntax similar to ms, handles any arbitrary scenario","Issues and warnings":"Does not handle gene conversion and fixed number of segregating sites (unlike ms)","Link":"https://scrm.github.io/","Reference":"(Staab et al., 2015)"},{"Software":"SPLATCHE3","Class of method":"coalescent simulations","Purpose":"Simulating demographic scenarios in their spatial context","Specifics":"Coalescent simulator for genetic data, forward-in-time for demography in space. Spatially explicit.","Issues and warnings":"Simulations can be slow (>1 hour) for large datasets (>100,000 SNPs) over more than 1,000 generations. Does not incorporate selection","Link":"http://www.splatche.com/splatche3","Reference":"(Currat et al., 2019)"},{"Software":"Coalescence","Class of method":"discoal","Purpose":"Simulate selective sweeps under arbitrary demographic scenarios","Specifics":"Relatively fast for short genomic fragments. Designed to simulate \"hard\" and \"soft\" sweeps.","Issues and warnings":"Mostly used with diploS/HIC. Other simulators such as msms may be more suited for some scenarios.","Link":"https://github.com/kr-colab/discoal","Reference":"(Kern and Schrider, 2016)"},{"Software":"QuantiNemo2","Class of method":"Forward-in-time simulations","Purpose":"Simulating demographic and selection scenarios in their spatial context","Specifics":"Comprehensive simulator.Designed for the study of selection in a spatially-explicit context. Simulates quantitative traits, fitness landscapes and underlying genetic variation with migration. Include both population and individual-based simulations","Issues and warnings":"Scan be slow for large/complex models","Link":"https://www2.unil.ch/popgen/softwares/quantinemo/","Reference":"(Currat et al., 2019)(Neuenschwander et al., 2019)"},{"Software":"SliM3","Class of method":"Forward-in-time simulations","Purpose":"Simulating genomic sequences with intrinsic and extrinsic factors","Specifics":"One of the most comprehensive simulators. Can simulate genetic data in their spatio-temporal context, the effects of selection at linked sites, coding and non-coding variation, inbreeding and selfing. Supports tree-sequence recording for faster simulations. Large community.","Issues and warnings":"Slow for large genomic regions/large populations","Link":"https://messerlab.org/slim/","Reference":"(Haller and Messer, 2019)"},{"Software":"diploS/HIC","Class of method":"Supervised Machine Learning","Purpose":"Detecting selective sweeps","Specifics":"Classifies genomic windows as neutral, selected, or impacted by selection at linked sites. Also distinguishes between selection on standing and de novo variation. Uses a set of summary statistics describing frequency spectrum and LD, does not require phasing. Good tutorial explaining the pipeline.","Issues and warnings":"Good performance depends on the parameters used to simulate sweeps (window size, selective coefficient, demography). Requires some trial and error for new model species. Interpretation of \"soft\" and \"hard\" sweeps remains discussed.","Link":"https://github.com/kr-colab/diploSHIC","Reference":"(Schrider and Kern, 2016; Kern and Schrider, 2018)"},{"Software":"evoNet","Class of method":"Supervised Machine Learning","Purpose":"Detecting selective sweeps, balancing selection, and estimate demographic history","Specifics":"Uses deep-learning algorithms to classify genomic regions as selected or neutral, and estimate effective population sizes. Flexible (any number of summary statistics can be provided by the investigator).","Issues and warnings":"Requires summary statistics as an input. Difficult for a naïve user.","Link":"https://sourceforge.net/projects/evonet/?source=typ_redirect","Reference":"(Sheehan and Song, 2016)"},{"Software":"FastEPRR","Class of method":"Supervised Machine Learning","Purpose":"Estimating effective recombination rates","Specifics":"Uses regression to estimate effective recombination rates from SNP alignments. Can use the VCF format. No clear bias due to phasing errors observed. Can incorporate demographic history (using ms command line).","Issues and warnings":"Requires phased data.","Link":"https://www.picb.ac.cn/evolgen/softwares/index.html","Reference":"(Gao et al., 2016)"},{"Software":"FILET","Class of method":"Supervised Machine Learning","Purpose":"Detecting introgression","Specifics":"Uses Extra Trees classifiers and dedicated summary statistics to classify genomic windows as being introgressed or not. Identifies the direction of introgression.","Issues and warnings":"Targets pulse of introgression rather than continuous gene flow, but can detect the latter. Requires phased data in a fasta format.","Link":"https://github.com/kr-colab/FILET","Reference":"(Gao et al., 2016)"},{"Software":"genomatnn","Class of method":"Supervised Machine Learning","Purpose":"Detecting adaptive introgression","Specifics":"Uses convolutional neural networks to identify adaptive introgression. Trained using the tree-sequence records obtained from SliM3. Can handle VCF files and unphased data.","Issues and warnings":"Strong computational bottleneck with SliM simulations.","Link":"https://github.com/grahamgower/genomatnn","Reference":"(Gower et al., 2020)"},{"Software":"ImaGene","Class of method":"Supervised Machine Learning","Purpose":"Detecting selective sweeps","Specifics":"Uses convolutional neural networks to classify genomic windows in bins of distinct selection coefficients. Directly uses the image of the alignment, avoiding compression (i.e. using summary statistics)","Issues and warnings":"Can be slow for large datasets.","Link":"https://github.com/mfumagalli/ImaGene","Reference":"(Torada et al., 2019)"},{"Software":"RELERNN","Class of method":"Supervised Machine Learning","Purpose":"Estimating recombination rates","Specifics":"Uses recurrent neural networks to estimate recombination rates from SNP alignments. Handles unphased and pooled data. Uses msprime (Python implementation of ms) to generate simulations upon which the algorithm is trained. Can incorporate known demographic history provided by the user.","Issues and warnings":"Can be computationnally intensive for large effective population sizes. Accuracy on pooled data is modest for low depth of coverage. Absolute estimates of recombination rates depends on the accuracy of the mutation rate used for simulations.","Link":"https://github.com/kr-colab/ReLERNN","Reference":"(Adrion, Galloway, et al., 2020)"},{"Software":"SWiFr","Class of method":"Supervised Machine Learning","Purpose":"Detecting selective sweeps","Specifics":"Uses averaged one-dependence estimator to classify genomic regions as selected or neutral. Flexible in terms of which summary statistics are used. Can incorporate demographic history.","Issues and warnings":"Requires summary statistics as an input. Only distinguishes between selective sweeps and neutral regions.","Link":"https://github.com/ramachandran-lab/SWIFr/blob/master/README.md","Reference":"(Sugden et al., 2018)"}]